import os
import glob
from tqdm import tqdm

# Номера сертификатов
Num_SERT =  [302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321,
    322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343,
    344, 345, 346, 347, 332, 348, 349, 350, 351, 333, 352, 356, 358, 359, 360, 361, 362, 363, 364, 365,
    366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385,
    386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397]

a = 302 # Первая папка
b = 397 # Последняя папка
INpath = rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД'
worry = [] # непонятки

def worrymessage(pt, nm1, nm2):
    worry.append(pt)
    worry.append(nm1)
    worry.append(nm2)

for i in tqdm(range(0, len(Num_SERT)), desc='Идет проверка папок'):
    name = str(Num_SERT[i]) + ' - РЖД'

    list0 = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\0*')
    list1 = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\1*')
    list2 = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\2*')
    list3 = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\3*')
    list4 = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\4*')
    list5 = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\5*')
    list6 = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\6*')
    list7 = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\7*')
    list8 = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\8*')
    list9 = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\9*')
    list10 = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\10*')
    list11 = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\11*')
    list12 = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\12*')

    dest0 = [rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\0 Заявка и приложение (+)',
             rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\0 Заявка и приложение (+—)',
             rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\0 Заявка и приложение (—)']
    dest1 = [rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\1 Распоряжение по заявке (+)',
             rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\1 Распоряжение по заявке (—)']
    dest2 = [rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\2 Решение по заявке (+)',
             rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\2 Решение по заявке (—)']
    dest3 = [rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\3 Заключения по ОМД и ТД (+)',
             rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\3 Заключения по ОМД и ТД (—)']
    dest4 = [rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\4 Акт выбора ПК (+)',
             rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\4 Акт выбора ПК (—)']
    dest5 = [rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\5 Протоколы СИ (+)',
             rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\5 Протоколы СИ (—)']
    dest6 = [rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\6 Заключение СИ (+)',
             rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\6 Заключение СИ (—)']
    dest7 = [rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\7 Программа проверки произв (+)',
             rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\7 Программа проверки произв (—)']
    dest8 = [rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\8 Акт ПП (+)',
             rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\8 Акт ПП (—)']
    dest9 = [rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\9 Распоряжение на анализ (+)',
             rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\9 Распоряжение на анализ (—)']
    dest10 = [rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\10 Решение о выдаче (+)',
              rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\10 Решение о выдаче (+—)',
              rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\10 Решение о выдаче (—)']
    dest11 = [rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\11 Сертификат (+)',
              rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\11 Сертификат (+—)',
              rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\11 Сертификат (—)']
    dest12 = [rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\12 Доп.материалы (+)',
              rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{name}\12 Доп.материалы (—)']

    listF = [list0[0], list1[0], list2[0], list3[0], list4[0], list5[0], list6[0], list7[0], list8[0], list9[0],
             list10[0], list11[0], list12[0]]

    listDest = [dest0, dest1, dest2, dest3, dest4, dest5, dest6, dest7, dest8, dest9, dest10, dest11, dest12]

    for j in range(-1, 13):
        try:
            contents = os.listdir(listF[j])
            # Для папок с 1 файлом
            if len(listDest[j]) == 2 and j != 3 and j != 5:
                if len(contents) == 1 and listF[j] != listDest[j][0]:
                    os.rename(listF[j], listDest[j][0])
                elif len(contents) == 0 and listF[j] != listDest[j][1]:
                    os.rename(listF[j], listDest[j][1])
                elif len(contents) > 1 and j != 12:
                    worrymessage(listF[j], len(contents), '1')

            # Для папки 3 отдельно
            elif j == 3:
                if len(contents) == 4 and listF[j] != listDest[j][0]:
                    os.rename(listF[j], listDest[j][0])
                elif len(contents) == 3 and listF[j] != listDest[j][1]:
                    os.rename(listF[j], listDest[j][1])
                elif len(contents) > 4:
                    worrymessage(listF[j], len(contents), '1')

            # Для папки 5 отдельно
            elif j == 5:
                if len(contents) > 0 and listF[j] != listDest[j][0]:
                    os.rename(listF[j], listDest[j][0])
                elif len(contents) == 0 and listF[j] != listDest[j][1]:
                    os.rename(listF[j], listDest[j][1])
                elif len(contents) > 20:
                    worrymessage(listF[j], len(contents), 'не так много')

            # Для папок с 2 файлами
            elif len(listDest[j]) == 3:
                if len(contents) == 2 and listF[j] != listDest[j][0]:
                    os.rename(listF[j], listDest[j][0])
                elif len(contents) == 1 and listF[j] != listDest[j][1]:
                    os.rename(listF[j], listDest[j][1])
                elif len(contents) == 0 and listF[j] != listDest[j][2]:
                    os.rename(listF[j], listDest[j][2])
                elif len(contents) > 2 and j != 3:
                    worrymessage(listF[j], len(contents), '2')
        except FileNotFoundError:
            print(f"Папка '{listF[j]}' не существует.")

print('Проверка завершена!')
for i in range(0, len(worry), 3):
    print('Пожалуйста проверьте папку:', worry[i], 'там находится ', worry[i + 1], 'файла, вместо', worry[i + 2])