import os
import glob
from tqdm import tqdm

# Сертификаты 2023 года
Num_SERT =  [201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215,
    216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230,
    231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245,
    246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260,
    261, 262, 263, 264]

folder_names = [
    "201 - АО КЭС им. Пискунова (01.02.2023)",
    "202 - Башкирэнерго-БЭС (31.03.2023)",
    "203 - Башкирэнерго-СЭС (31.03.2023)",
    "204 - Башкирэнерго-БцЭС (31.03.2023)",
    "205 - Сахалинэнерго (28.05.2023)",
    "206 - Башкирэнерго-СВЭС (30.04.2023)",
    "207 - Башкирэнерго-СВЭС (30.04.2023)",
    "208 - Башкирэнерго-СЭС (30.04.2023)",
    "209 - Башкирэнерго-УГЭС (30.04.2023)",
    "210 - Башкирэнерго-ЦЭС (30.04.2023)",
    "211 - Башкирэнерго-ЦЭС (30.04.2023)",
    "212 - Башкирэнерго-БЭС (30.04.2023)",
    "213 - Башкирэнерго-КЭС (30.04.2023)",
    "214 - Башкирэнерго-СЭС (30.05.2023)",
    "215 - Башкирэнерго-ЦЭС (30.05.2023)",
    "216 - Башкирэнерго-СВЭС (30.05.2023)",
    "217 - Башкирэнерго-ИЭС (30.05.2023)",
    "218 - Башкирэнерго-БцЭС (30.05.2023)",
    "219 - Прионежская СК (23.06.2023)",
    "220 - Башкирэнерго-БЭС (29.06.2023)",
    "221 - Башкирэнерго-СВЭС (29.06.2023)",
    "222 - Башкирэнерго-СЭС (29.06.2023)",
    "223 - Башкирэнерго-ИЭС (29.06.2023)",
    "224 - Башкирэнерго-КЭС (29.06.2023)",
    "225 - ОЭК-Ростов (30.06.2023)",
    "226 - Камчатскэнерго ЦЭС (28.07.2023)",
    "227 - Башкирэнерго-УГЭС (28.07.2023) ок",
    "228 - Башкирэнерго-УГЭС (28.07.2023) ок",
    "229 - Башкирэнерго-БцЭС (28.07.2023) ок",
    "230 - Башкирэнерго-ЦЭС (28.07.2023) ок",
    "231 - Башкирэнерго-ИЭС (28.07.2023) ок",
    "232 - Башкирэнерго-ОЭС (28.07.2023) ок",
    "233 - Башкирэнерго-ОЭС (28.07.2023) ок",
    "234 - КЭС им.Пискунова (25.08.2023)",
    "235 - Вологодский ф-л Россети С-3, ВУЭС (29.08.2023)",
    "236 - Вологодский ф-л Россети С-3, ЧЭС (29.08.2023)",
    "237 - Уральские ЭС (29.08.2023)",
    "238 - Уральские ЭС (29.08.2023)",
    "239 - Башкирэнерго-КЭС (30.08.2023) ок",
    "240 - Башкирэнерго-СЭС (30.08.2023) ок",
    "241 - Башкирэнерго-УГЭС (30.08.2023) ок",
    "242 - Башкирэнерго-ЦЭС (30.08.2023) ок",
    "243 - Башкирэнерго-ОЭС (30.08.2023) ок",
    "244 - Вологодский ф-л Россети С-3, ВЭС (11.09.2023)",
    "245 - Оборонэнерго-Камч. (28.09.2023)",
    "246 - Башкирэнерго-ЦЭС (29.09.2023) ок",
    "247 - Карельский ф-л Россети С-3, ЗКЭС (29.09.2023)",
    "248 - Карельский ф-л Россети С-3, СЭС (17.10.2023)",
    "249 - Карельский ф-л Россети С-3, ЮКЭС (23.10.2023)",
    "250 - Промэнергосбыт Новомосковск (25.10.2023)",
    "251 - Башкирэнерго-НЭС (30.10.2023) ок",
    "252 - Башкирэнерго-НЭС (30.10.2023) ок",
    "253 - Башкирэнерго-НЭС (30.10.2023) ок",
    "254 - Башкирэнерго-ОЭС (30.10.2023) ок",
    "255 - Волгодонск (13.11.2023)",
    "256 - Ленэнерго, СЭС (16.11.2023)",
    "257 - СМЗ, Самара (20.11.2023)",
    "258 - Ленэнерго, КС (24.11.2023)",
    "259 - Ленэнерго - КнЭС (13.12.2023)",
    "260 - Салют-Самара (13.12.2023)",
    "261 - Оборонэнерго-Вологда (13.12.2023)",
    "262 - Жилкомхоз (29.12.2023)",
    "263 - Агроимпульс-Кгд (29.12.2023) нет скана",
    "264 - Энергосеть-Кгд (29.12.2023) нет скана"
]


namef = []

for i in tqdm(range(0, len(Num_SERT))):
    
    name = folder_names[i]
    pathSI = rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Сертификаты_2023\{name}\СИ'
    pathIK1 = rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Сертификаты_2023\{name}\ИК1'
    pathIK2 = rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Сертификаты_2023\{name}\ИК2'
    pathIK3 = rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Сертификаты_2023\{name}\ИК3'

    path0 = rf'{pathSI}\0 Заявка и приложение'
    path1 = rf'{pathSI}\1 Распоряжение по заявке'
    path2 = rf'{pathSI}\2 Решение по заявке'
    path3 = rf'{pathSI}\3 Заключения по ОМД и ТД'
    path4 = rf'{pathSI}\4 Акт выбора ПК'
    path5 = rf'{pathSI}\5 Протоколы СИ'
    path6 = rf'{pathSI}\6 Заключение СИ'
    path7 = rf'{pathSI}\7 Программа проверки произ'
    path8 = rf'{pathSI}\8 Акт ПП'
    path9 = rf'{pathSI}\9 Распоряжение на анализ'
    path10 = rf'{pathSI}\10 Решение о выдаче'
    path11 = rf'{pathSI}\11 Сертификат'
    path12 = rf'{pathSI}\12 Доп.материалы'

    path3_1 = rf'{pathSI}\3 Заключения по ОМД и ТД\3.1 Заключение ОМД'
    path3_2 = rf'{pathSI}\3 Заключения по ОМД и ТД\3.2 Заключение ТД и РПН'
    path3_3 = rf'{pathSI}\3 Заключения по ОМД и ТД\3.3 Заключение ПМ'

    pathIK1_0 = rf'{pathIK1}\0'
    pathIK1_1 = rf'{pathIK1}\1'
    pathIK1_2 = rf'{pathIK1}\2'
    pathIK1_3 = rf'{pathIK1}\3'
    pathIK1_4 = rf'{pathIK1}\4'
    pathIK1_5 = rf'{pathIK1}\5'
    pathIK1_6 = rf'{pathIK1}\6'
    pathIK1_7 = rf'{pathIK1}\7'
    pathIK1_8 = rf'{pathIK1}\8'
    
    pathIK2_0 = rf'{pathIK2}\0'
    pathIK2_1 = rf'{pathIK2}\1'
    pathIK2_2 = rf'{pathIK2}\2'
    pathIK2_3 = rf'{pathIK2}\3'
    pathIK2_4 = rf'{pathIK2}\4'
    pathIK2_5 = rf'{pathIK2}\5'
    pathIK2_6 = rf'{pathIK2}\6'
    pathIK2_7 = rf'{pathIK2}\7'
    pathIK2_8 = rf'{pathIK2}\8'
    
    pathIK3_0 = rf'{pathIK3}\0'
    pathIK3_1 = rf'{pathIK3}\1'
    pathIK3_2 = rf'{pathIK3}\2'
    pathIK3_3 = rf'{pathIK3}\3'
    pathIK3_4 = rf'{pathIK3}\4'
    pathIK3_5 = rf'{pathIK3}\5'
    pathIK3_6 = rf'{pathIK3}\6'
    pathIK3_7 = rf'{pathIK3}\7'
    pathIK3_8 = rf'{pathIK3}\8'

    pathListSI = [path0, path1, path2, path3, path4, path5, path6, path7, path8, path9, path10, path11, path12]
    pathList_3 = [path3_1, path3_2, path3_3]
    pathlistIK1 = [pathIK1_0, pathIK1_1, pathIK1_2, pathIK1_3, pathIK1_4, pathIK1_5, pathIK1_6, pathIK1_7, pathIK1_8]
    pathlistIK2 = [pathIK2_0, pathIK2_1, pathIK2_2, pathIK2_3, pathIK2_4, pathIK2_5, pathIK2_6, pathIK2_7, pathIK2_8]
    pathlistIK3 = [pathIK3_0, pathIK3_1, pathIK3_2, pathIK3_3, pathIK3_4, pathIK3_5, pathIK3_6, pathIK3_7, pathIK3_8]

    # Создание папки СИ и ее содержимого
    if not os.path.exists(pathSI):
        for j in range(0, len(pathListSI)):
            if j == 3 and not os.path.exists(pathListSI[j]):
                os.makedirs(pathListSI[j])
                os.makedirs(pathList_3[0])
                os.makedirs(pathList_3[1])
                os.makedirs(pathList_3[2])
            elif not os.path.exists(pathListSI[j]):
                os.makedirs(pathListSI[j])

    # Создание папки ИК1 и ее содержимого
    if not os.path.exists(pathIK1):
        for j in range(0, len(pathlistIK1)):
            if not os.path.exists(pathlistIK1[j]):
                os.makedirs(pathlistIK1[j])

    # Создание папки ИК2 и ее содержимого
    if not os.path.exists(pathIK2):
        for j in range(0, len(pathlistIK2)):
            if not os.path.exists(pathlistIK2[j]):
                os.makedirs(pathlistIK2[j])

   # Создание папки ИК3 и ее содержимого
    if not os.path.exists(pathIK3):
        for j in range(0, len(pathlistIK3)):
            if not os.path.exists(pathlistIK3[j]):
                os.makedirs(pathlistIK3[j])

        
print('Successful!')