import os
import shutil
import glob
from tqdm import tqdm

Num_Sert = [
    "302", "303", "304", "305", "306", "307", "308", "309", "310", "311",
    "312", "313", "314", "315", "316", "317", "318", "319", "320", "321",
    "322", "323", "324", "325", "326", "327", "328", "329", "330", "331",
    "334", "335", "336", "337", "338", "339", "340", "341", "342", "343",
    "344", "345", "346", "347", "332", "348", "349", "350", "351", "333",
    "352", "356", "358", "359", "360", "361", "362", "363", "364", "365",
    "366", "367", "368", "369", "370", "371", "372", "373", "374", "375",
    "376", "377", "378", "379", "380", "381", "382", "383", "384", "385",
    "386", "387", "388", "389", "390", "391", "392", "393", "394", "395",
    "396", "397"
]

# Номера заявок
Num_Apl = ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10',
    '11', '12', '13', '14', '15', '16', '17', '18', '19', '20',
    '21', '22', '23', '24', '25', '26', '27', '28', '29', '30',
    '33', '34', '35', '36', '37', '38', '39', '40', '41', '42',
    '43', '44', '45', '46', '31', '47', '48', '49', '50', '32',
    '51', '52', '53', '54', '55', '56', '57', '58', '59', '60',
    '61', '62', '63', '64', '65', '66', '67', '68', '69', '70',
    '71', '72', '73', '74', '75', '76', '77', '78', '79', '80',
    '81', '82', '83', '84', '85', '86', '87', '88', '89', '90',
    '91', '92']


# Номер ОС
Num_OS = [
    "ОС-500-24", "ОС-501-24", "ОС-502-24", "ОС-503-24", "ОС-504-24",
    "ОС-505-24", "ОС-496-24", "ОС-484-24", "ОС-485-24", "ОС-486-24",
    "ОС-487-24", "ОС-464-24", "ОС-465-24", "ОС-466-24", "ОС-467-24",
    "ОС-468-24", "ОС-469-24", "ОС-443-24", "ОС-444-24", "ОС-445-24",
    "ОС-446-24", "ОС-447-24", "ОС-448-24", "ОС-449-24", "ОС-450-24",
    "ОС-452-24", "ОС-453-24", "ОС-454-24", "ОС-434-24", "ОС-435-24",
    "ОС-416-24", "ОС-417-24", "ОС-418-24", "ОС-419-24", "ОС-420-24",
    "ОС-421-24", "ОС-422-24", "ОС-423-24", "ОС-424-24", "ОС-479-24",
    "ОС-480-24", "ОС-481-24", "ОС-482-24", "ОС-483-24", "ОС-488-24",
    "ОС-489-24", "ОС-490-24", "ОС-491-24", "ОС-492-24", "ОС-498-24",
    "ОС-499-24", "ОС-493-24", "ОС-494-24", "ОС-495-24", "ОС-470-24",
    "ОС-471-24", "ОС-507-24", "ОС-472-24", "ОС-473-24", "ОС-474-24",
    "ОС-475-24", "ОС-476-24", "ОС-477-24", "ОС-478-24", "ОС-425-24",
    "ОС-426-24", "ОС-427-24", "ОС-428-24", "ОС-429-24", "ОС-430-24",
    "ОС-431-24", "ОС-432-24", "ОС-433-24", "ОС-436-24", "ОС-451-24",
    "ОС-437-24", "ОС-438-24", "ОС-439-24", "ОС-440-24", "ОС-441-24",
    "ОС-442-24", "ОС-506-24", "ОС-455-24", "ОС-456-24", "ОС-457-24",
    "ОС-458-24", "ОС-459-24", "ОС-460-24", "ОС-461-24", "ОС-462-24",
    "ОС-463-24", "ОС-497-24"
        ]

Num_RA = [
    "ОС-500-24-РА", "ОС-501-24-РА", "ОС-502-24-РА", "ОС-503-24-РА", "ОС-504-24-РА",
    "ОС-505-24-РА", "ОС-496-24-РА", "ОС-484-24-РА", "ОС-485-24-РА", "ОС-486-24-РА",
    "ОС-487-24-РА", "ОС-464-24-РА", "ОС-465-24-РА", "ОС-466-24-РА", "ОС-467-24-РА",
    "ОС-468-24-РА", "ОС-469-24-РА", "ОС-443-24-РА", "ОС-444-24-РА", "ОС-445-24-РА",
    "ОС-446-24-РА", "ОС-447-24-РА", "ОС-448-24-РА", "ОС-449-24-РА", "ОС-450-24-РА",
    "ОС-452-24-РА", "ОС-453-24-РА", "ОС-454-24-РА", "ОС-434-24-РА", "ОС-435-24-РА",
    "ОС-416-24-РА", "ОС-417-24-РА", "ОС-418-24-РА", "ОС-419-24-РА", "ОС-420-24-РА",
    "ОС-421-24-РА", "ОС-422-24-РА", "ОС-423-24-РА", "ОС-424-24-РА", "ОС-479-24-РА",
    "ОС-480-24-РА", "ОС-481-24-РА", "ОС-482-24-РА", "ОС-483-24-РА", "ОС-488-24-РА",
    "ОС-489-24-РА", "ОС-490-24-РА", "ОС-491-24-РА", "ОС-492-24-РА", "ОС-498-24-РА",
    "ОС-499-24-РА", "ОС-493-24-РА", "ОС-494-24-РА", "ОС-495-24-РА", "ОС-470-24-РА",
    "ОС-471-24-РА", "ОС-507-24-РА", "ОС-472-24-РА", "ОС-473-24-РА", "ОС-474-24-РА",
    "ОС-475-24-РА", "ОС-476-24-РА", "ОС-477-24-РА", "ОС-478-24-РА", "ОС-425-24-РА",
    "ОС-426-24-РА", "ОС-427-24-РА", "ОС-428-24-РА", "ОС-429-24-РА", "ОС-430-24-РА",
    "ОС-431-24-РА", "ОС-432-24-РА", "ОС-433-24-РА", "ОС-436-24-РА", "ОС-451-24-РА",
    "ОС-437-24-РА", "ОС-438-24-РА", "ОС-439-24-РА", "ОС-440-24-РА", "ОС-441-24-РА",
    "ОС-442-24-РА", "ОС-506-24-РА", "ОС-455-24-РА", "ОС-456-24-РА", "ОС-457-24-РА",
    "ОС-458-24-РА", "ОС-459-24-РА", "ОС-460-24-РА", "ОС-461-24-РА", "ОС-462-24-РА",
    "ОС-463-24-РА", "ОС-497-24-РА"
        ]

Num_RZ = [
    "ОС-500-24-РЗ", "ОС-501-24-РЗ", "ОС-502-24-РЗ", "ОС-503-24-РЗ", "ОС-504-24-РЗ",
    "ОС-505-24-РЗ", "ОС-496-24-РЗ", "ОС-484-24-РЗ", "ОС-485-24-РЗ", "ОС-486-24-РЗ",
    "ОС-487-24-РЗ", "ОС-464-24-РЗ", "ОС-465-24-РЗ", "ОС-466-24-РЗ", "ОС-467-24-РЗ",
    "ОС-468-24-РЗ", "ОС-469-24-РЗ", "ОС-443-24-РЗ", "ОС-444-24-РЗ", "ОС-445-24-РЗ",
    "ОС-446-24-РЗ", "ОС-447-24-РЗ", "ОС-448-24-РЗ", "ОС-449-24-РЗ", "ОС-450-24-РЗ",
    "ОС-452-24-РЗ", "ОС-453-24-РЗ", "ОС-454-24-РЗ", "ОС-434-24-РЗ", "ОС-435-24-РЗ",
    "ОС-416-24-РЗ", "ОС-417-24-РЗ", "ОС-418-24-РЗ", "ОС-419-24-РЗ", "ОС-420-24-РЗ",
    "ОС-421-24-РЗ", "ОС-422-24-РЗ", "ОС-423-24-РЗ", "ОС-424-24-РЗ", "ОС-479-24-РЗ",
    "ОС-480-24-РЗ", "ОС-481-24-РЗ", "ОС-482-24-РЗ", "ОС-483-24-РЗ", "ОС-488-24-РЗ",
    "ОС-489-24-РЗ", "ОС-490-24-РЗ", "ОС-491-24-РЗ", "ОС-492-24-РЗ", "ОС-498-24-РЗ",
    "ОС-499-24-РЗ", "ОС-493-24-РЗ", "ОС-494-24-РЗ", "ОС-495-24-РЗ", "ОС-470-24-РЗ",
    "ОС-471-24-РЗ", "ОС-507-24-РЗ", "ОС-472-24-РЗ", "ОС-473-24-РЗ", "ОС-474-24-РЗ",
    "ОС-475-24-РЗ", "ОС-476-24-РЗ", "ОС-477-24-РЗ", "ОС-478-24-РЗ", "ОС-425-24-РЗ",
    "ОС-426-24-РЗ", "ОС-427-24-РЗ", "ОС-428-24-РЗ", "ОС-429-24-РЗ", "ОС-430-24-РЗ",
    "ОС-431-24-РЗ", "ОС-432-24-РЗ", "ОС-433-24-РЗ", "ОС-436-24-РЗ", "ОС-451-24-РЗ",
    "ОС-437-24-РЗ", "ОС-438-24-РЗ", "ОС-439-24-РЗ", "ОС-440-24-РЗ", "ОС-441-24-РЗ",
    "ОС-442-24-РЗ", "ОС-506-24-РЗ", "ОС-455-24-РЗ", "ОС-456-24-РЗ", "ОС-457-24-РЗ",
    "ОС-458-24-РЗ", "ОС-459-24-РЗ", "ОС-460-24-РЗ", "ОС-461-24-РЗ", "ОС-462-24-РЗ",
    "ОС-463-24-РЗ", "ОС-497-24-РЗ"
        ]

# ПУТЬ К КОРНЕВОЙ ПАПКЕ
INpath = rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Сертификаты_РЖД'


# Названия папок
folder_names = os.listdir(INpath)

# for i in tqdm(range(0, len(Num_Sert))):
#     file1 = rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\Распоряжения\Расп по заявке\{Num_R[i]}.pdf'
#     dest = rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Сертификаты_РЖД\{Num_Sert[i]} - РЖД\0. СИ\1 Распоряжение по заявке (—)'
#
#     contents = os.listdir(dest)
#     if len(contents) == 0:
#         shutil.copy(file1, dest)
#         print(file1, ' => ', dest)

for i in tqdm(range(0, len(Num_Sert))):
    file = rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\Распоряжения\Расп на анализ\{Num_RA[i]}.pdf'
    dest = rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Сертификаты_РЖД\{Num_Sert[i]} - РЖД\0. СИ\9 Распоряжение на анализ (—)'

    contents = os.listdir(dest)
    if len(contents) == 0:
        shutil.copy(file, dest)

# # заявка
# for i in range(0, len(Num_SERT)):
#     source = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\01. Заявки РЖД\*\*{Num_Apl[i]}*')
#     dest = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{Num_SERT[i]} - РЖД\0 Заявка и приложение*')
#     file1 = source[0]
#     destf = dest[0]
#     contents = os.listdir(destf)
#     if len(contents) == 0:
#         shutil.copy(file1, destf)
#         print(file1, ' => ', destf)

# # приложение к заявке
# for i in range(0, len(Num_SERT)):
#     source = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\Приложения к заявкам\*{Num_Apl[i]}*')
#     dest = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{Num_SERT[i]} - РЖД\0 Заявка и приложение*')
#     file1 = source[0]
#     destf = dest[0]
#     contents = os.listdir(destf)
#     if len(contents) == 0 or len(contents) == 1:
#         shutil.copy(file1, destf)
#         print(file1, ' => ', destf)
#
# # сертификаты
# for i in range(0, len(Num_SERT)):
#     source = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\Сертификаты\{Num_SERT[i]}*\№  РОСС RU*')
#     dest = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{Num_SERT[i]} - РЖД\11 Сертификат*')
#     file1 = source[0]
#     file2 = source[1]
#     destf = dest[0]
#     contents = os.listdir(destf)
#     if len(contents) == 0:
#         shutil.copy(file1, destf)
#         shutil.copy(file2, destf)
#         print(file1, file2, ' => ', destf)
#
# # Акт ПП
# for i in range(0, len(Num_SERT)):
#     source = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\Сертификаты\{Num_SERT[i]}*\*АСП*')
#     dest = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{Num_SERT[i]} - РЖД\8 Акт ПП*')
#     file1 = source[0]
#     destf = dest[0]
#     contents = os.listdir(destf)
#     if len(contents) == 0:
#         shutil.copy(file1, destf)
#         print(file1, ' => ', destf)

# # Заключения по ОМД и ТД
# for i in range(0, len(Num_SERT)):
#     source = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\Сертификаты\{Num_SERT[i]}*\*ОМД*')
#     dest = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{Num_SERT[i]} - РЖД\3 Заключения по ОМД и ТД*')
#     file1 = source[0]
#     destf = dest[0]
#     contents = os.listdir(destf)
#     if len(contents) == 3:
#         shutil.copy(file1, destf)
#         print(file1, ' => ', destf)

# # Акт выбора ПК
# for i in range(0, len(Num_SERT)):
#     source = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\Сертификаты\{Num_SERT[i]}*\*ПК*')
#     dest = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{Num_SERT[i]} - РЖД\4 Акт выбора ПК*')
#     file1 = source[0]
#     destf = dest[0]
#     contents = os.listdir(destf)
#     if len(contents) == 0:
#         shutil.copy(file1, destf)
#         print(file1, ' => ', destf)
#
# # Заключение СИ
# for i in range(0, len(Num_SERT)):
#     source = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\Сертификаты\{Num_SERT[i]}*\*ЭЗС*')
#     dest = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{Num_SERT[i]} - РЖД\6 Заключение СИ*')
#     file1 = source[0]
#     destf = dest[0]
#     contents = os.listdir(destf)
#     if len(contents) == 0:
#         shutil.copy(file1, destf)
#         print(file1, ' => ', destf)
#
# # Решение по заявке
# for i in range(0, len(Num_SERT)):
#     source = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\Сертификаты\{Num_SERT[i]}*\*{Num_OS}*Р1*')
#     dest = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{Num_SERT[i]} - РЖД\2 Решение по заявке*')
#     file1 = source[0]
#     destf = dest[0]
#     contents = os.listdir(destf)
#     if len(contents) == 0:
#         shutil.copy(file1, destf)
#         print(file1, ' => ', destf)
#
# # Решение о выдаче
# for i in range(0, len(Num_SERT)):
#     source = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\Сертификаты\{Num_SERT[i]}*\*{Num_OS}*Р2*(*)*')
#     dest = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{Num_SERT[i]} - РЖД\10 Решение о выдаче*')
#     destf = dest[0]
#     contents = os.listdir(destf)
#     if len(contents) == 0:
#         for j in range(0, len(source)):
#             file1 = source[j]
#             shutil.copy(source[j], destf)
#             shutil.copy(source[j], destf)
#             print(source[j], ' => ', destf)


# listST = [  336, 306, 312, 318, 327, 303, 297, 182, 173, 167, 162, 77, 83, 88, 101, 99,
#             93, 4, 10, 13, 18, 24, 30, 38, 41, 150, 133, 158, 109, 105, 99, 47, 58,
#             48, 76, 71, 53, 62, 50, 215, 221, 194, 201, 207, 232, 249, 237, 223, 240,
#             340, 352, 264, 270, 280, 119, 127, 128, 133, 137, 139, 141, 143, 147, 149,
#             150, 154, 157, 163, 167, 169, 171, 175, 179, 182, 14, 206, 198, 194, 190,
#             200, 214, 210, 121, 122, 141, 147, 129, 154, 110, 119, 112, 289]
#
# listFN = [  339, 311, 317, 326, 335, 305, 302, 193, 181, 172, 166, 82, 87, 92, 109,
#             100, 98, 9, 12, 13, 23, 29, 37, 40, 46, 153, 140, 161, 114, 108, 104,
#             47, 61, 49, 76, 75, 57, 70, 52, 220, 222, 200, 206, 214, 236, 263, 239,
#             231, 248, 351, 363, 269, 279, 288, 126, 127, 132, 136, 138, 140, 142,
#             146, 148, 149, 153, 156, 162, 166, 168, 170, 174, 178, 181, 185, 17,
#             209, 199, 197, 193, 205, 216, 213, 121, 128, 146, 149, 132, 157, 111,
#             120, 118, 296]
#
# # ЭнерТест / Ростест
# listNM = ["ЭнерТест", "ЭнерТест","ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест",
#         "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест",
#         "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест",
#         "ЭнерТест", "Ростест", "Ростест", "Ростест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест", "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "ЭнерТест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "Ростест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест",
# "ЭнерТест"]
#
# # Протоколы СИ
# for i in range(0, len(Num_SERT)):
#     dest = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{Num_SERT[i]} - РЖД\5 Протоколы СИ*')
#     destCheck = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\!Папки РЖД\{Num_SERT[i]} - РЖД\5 Протоколы СИ*\*')
#     destf = dest[0]
#     contents = os.listdir(destf)
#     if listNM[i] == "ЭнерТест" :
#         for j in range(listST[i], listFN[i] + 1):
#             name2024 = '2024-' + str(j)
#             source = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\06. Протоколы СИ\ЭнерТест\*\*{name2024}*')
#             file1 = source[0]
#             contents = os.listdir(destf)
#
#             shutil.copy(file1, destf)
#             print(file1, ' => ', destf)
#
#     elif listNM[i] == "Ростест":
#         for j in range(listST[i], listFN[i] + 1):
#             namej = str(j)
#             name533 = 'Протокол № 553'
#             source = glob.glob(rf'\\192.168.34.9\линвит\ПОЛЬЗОВАТЕЛИ\USER49\06. Протоколы СИ\Ростест\*\*{name533}*{namej}*')
#             file1 = source[0]
#             contents = os.listdir(destf)
#
#             shutil.copy(file1, destf)
#             print(file1, ' => ', destf)

print('Successful!')